Note/LearningFPByParserCombinators.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-01-30 周四 18:56 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Learning Functional Programming by Parser Combinators!</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Comcx" />
</head>
<body>
<div id="content">
<h1 class="title">Learning Functional Programming by Parser Combinators!</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org6b3ae1b">1. Ideas</a></li>
<li><a href="#org4a94a8f">2. The main <i>Parser</i> type</a></li>
<li><a href="#orgeeec147">3. Find strucutres and properties of Parser</a>
<ul>
<li><a href="#org2a5785e">3.1. Parser can be a <span class="underline">Functor</span>.</a></li>
<li><a href="#orge3148ea">3.2. Parser can be an <span class="underline">Applicative</span>.</a></li>
<li><a href="#orga29b713">3.3. Parser can be a <span class="underline">Monad</span>.</a></li>
<li><a href="#orgec4249a">3.4. Parser can be an <span class="underline">Alternative</span>.</a></li>
<li><a href="#orgd9f6829">3.5. Parser should be a <span class="underline">Semigroup</span>.</a></li>
<li><a href="#orgc3c1fd6">3.6. Parser should be a <span class="underline">Monoid</span>.</a></li>
</ul>
</li>
<li><a href="#org8a60bf1">4. Our arsenal!</a>
<ul>
<li><a href="#org3fd7264">4.1. Parser Char</a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-org6b3ae1b" class="outline-2">
<h2 id="org6b3ae1b"><span class="section-number-2">1</span> Ideas</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>Functions are data.</li>
<li>Data should be well described and combined.</li>
</ol>

<p>
We can express parser functions in a more understandable way.
</p>
</div>
</div>


<div id="outline-container-org4a94a8f" class="outline-2">
<h2 id="org4a94a8f"><span class="section-number-2">2</span> The main <i>Parser</i> type</h2>
<div class="outline-text-2" id="text-2">
<p>
Parsers find structure within text, either to validate, or to get text into some representation. 
For example, in case we want to parse an integer from a string, 
we expect a value of an integer type as result of the parser. 
Therefore we parametrize our parser over the type of the expected value, this leads to the following definition.
</p>

<pre class="example">
newtype Parser a = P { parse :: String -&gt; [(String, a)] }
</pre>

<p>
It's just a function of the input string, returning a list of possible outcomes! 
A single outcome is the remaining input and the parsed value. Why multiple outomces? 
Well, we could parse things in different ways. 
For example <code>"1 + 2 + 3"</code> could be parsed as <code>(1 + 2) + 3</code> or <code>1 + (2 + 3)</code>.
</p>
</div>
</div>


<div id="outline-container-orgeeec147" class="outline-2">
<h2 id="orgeeec147"><span class="section-number-2">3</span> Find strucutres and properties of Parser</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org2a5785e" class="outline-3">
<h3 id="org2a5785e"><span class="section-number-3">3.1</span> Parser can be a <span class="underline">Functor</span>.</h3>
<div class="outline-text-3" id="text-3-1">
<pre class="example">
instance Functor Parser where
  fmap f p = P $ \xs -&gt; [ (f x, s) | (x, s) &lt;- parse p xs ]
</pre>
<p>
We just first parse and then map contents.
</p>
</div>
</div>

<div id="outline-container-orge3148ea" class="outline-3">
<h3 id="orge3148ea"><span class="section-number-3">3.2</span> Parser can be an <span class="underline">Applicative</span>.</h3>
<div class="outline-text-3" id="text-3-2">
<pre class="example">
instance Applicative Parser where
  pure x = P $ \xs -&gt; [(x, xs)]
  (P f) &lt;*&gt; (P a) = P $ 
    \xs -&gt; [ (f' x, s2) | (f', s1) &lt;- f xs, (x, s2) &lt;- a s1 ]
</pre>
<p>
Again, we first apply the first parser and then map the funtion to every results of
the next parser.
</p>
</div>
</div>

<div id="outline-container-orga29b713" class="outline-3">
<h3 id="orga29b713"><span class="section-number-3">3.3</span> Parser can be a <span class="underline">Monad</span>.</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Monad is powerful here again.
</p>
<pre class="example">
instance Monad Parser where
  return = pure
  (P p) &gt;&gt;= f = P $
    \xs -&gt; [ parse (f x) s | (x, s) &lt;- p xs ]
</pre>
</div>
</div>

<div id="outline-container-orgec4249a" class="outline-3">
<h3 id="orgec4249a"><span class="section-number-3">3.4</span> Parser can be an <span class="underline">Alternative</span>.</h3>
<div class="outline-text-3" id="text-3-4">
<p>
Applicative =&gt; Alternative
</p>
<pre class="example">
instance Alternative Parser where
  empty = mempty
  p &lt;|&gt; q = P $ \xs -&gt; parse (p &lt;&gt; q) xs
</pre>
<p>
To complete our definition, we need monoid and semigroup.
</p>
</div>
</div>

<div id="outline-container-orgd9f6829" class="outline-3">
<h3 id="orgd9f6829"><span class="section-number-3">3.5</span> Parser should be a <span class="underline">Semigroup</span>.</h3>
<div class="outline-text-3" id="text-3-5">
<pre class="example">
instance Semigroup (Parser a) where
  p &lt;&gt; q = P $ \xs -&gt; parse p xs &lt;&gt; parse q xs
</pre>
</div>
</div>

<div id="outline-container-orgc3c1fd6" class="outline-3">
<h3 id="orgc3c1fd6"><span class="section-number-3">3.6</span> Parser should be a <span class="underline">Monoid</span>.</h3>
<div class="outline-text-3" id="text-3-6">
<pre class="example">
instance Monoid (Parser a) where
  mempty = P $ \xs -&gt; []
</pre>
</div>
</div>
</div>


<div id="outline-container-org8a60bf1" class="outline-2">
<h2 id="org8a60bf1"><span class="section-number-2">4</span> Our arsenal!</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org3fd7264" class="outline-3">
<h3 id="org3fd7264"><span class="section-number-3">4.1</span> Parser Char</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Perhaps the most basic one is <code>item</code>.
</p>
<pre class="example">
item :: Parser Char
item = P $ \xs -&gt; case xs of
  []     -&gt; []
  (x:xs) -&gt; [(x, xs)]
</pre>
<p>
We just get the head character of the raw string.
</p>

<p>
Now we can add some constraints of Parser Char:
</p>
<pre class="example">
satisfy :: (Char -&gt; Bool) -&gt; Parser Char
satisfy c = do
  x &lt;- item
  if c x then return x else empty

oneOf :: String -&gt; Parser Char
oneOf = satisfy . flip elem
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2020-01-30 周四 00:00</p>
<p class="author">Author: Comcx</p>
<p class="date">Created: 2020-01-30 周四 18:56</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
